---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.HeadingTextTypeId
source: html/10e4affb-7622-5431-d0d1-a96575b2810f.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.HeadingTextTypeId Property

Element id of text associated with legend heading.

## Syntax (C#)
```csharp
public ElementId HeadingTextTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null